app/controllers/events_controller.rb

INSERT INTO "events" ("session_no", "event_name", "date", "coach_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "date" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["date", "2015-12-06 2-5pm"], ["updated_at", "2016-03-07 14:02:44.995722"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)